# 4. 打印一下内容
print('''⽂能提笔安天下,
武能上马定乾坤.
⼼存谋略何⼈胜,
古今英雄唯是君.''')


n = 66  # 理想数字n
num = int(input("请输入一个数字:"))
if num > n:
    print("猜大了")
elif num < n:
    print("猜小了")
else:
    print("猜对了")

# 6.年龄区分
'''
如果⼩于10, 提⽰⼩屁孩, 如果⼤于10, ⼩于 20, 提⽰⻘春期叛逆的⼩屁孩.
如果⼤于20, ⼩于30. 提⽰开始定性, 开始混社会的⼩ 屁孩⼉, 如果⼤于30, ⼩于
40. 提⽰看⽼⼤不⼩了, 赶紧结婚⼩屁孩⼉. 如果⼤于40, ⼩ 于50. 提⽰家⾥有个
不听话的⼩屁孩⼉. 如果⼤于50, ⼩于60. 提⽰⾃⼰⻢上变成不听 话的⽼屁孩⼉.
如果⼤于60, ⼩于70. 提⽰活着还不错的⽼屁孩⼉. 如果⼤于70, ⼩于 90. 提⽰⼈
⽣就快结束了的⼀个⽼屁孩⼉. 如果⼤于90以上. 提⽰. 再⻅了这个世界
'''

age = int(input("请输入你的年龄"))
# 判断年龄
if age < 10:
    print("小屁孩")
elif age < 20:
    print("⻘春期叛逆的⼩屁孩")
elif age < 30:
    print("开始定性")
elif age < 40:
    print("⽼⼤不⼩了, 赶紧结婚⼩屁孩⼉")
elif age < 50:
    print("家⾥有个不听话的⼩屁孩⼉")
elif age < 60:
    print("⾃⼰⻢上变成不听话的⽼屁孩⼉")
elif age < 70:
    print("活着还不错的⽼屁孩⼉")
elif age < 90:
    print("⼈⽣就快结束了的⼀个⽼屁孩⼉")
else:
    print("再⻅了这个世界")


# 8.
name = input("请输入麻花藤")
if name == '麻花藤':
    print("真聪明")
else:
    print("你是alex么?")

# 9.
month = input("请输入月份:") # 1月
if month == '1月':
    print("卤煮")
if month == '2月':
    print("卤煮火烧")
if month == '3月':
    print("卤煮不要饼")
if month == '4月':
    print("大果子")
if month == '5月':
    print("煎饼果子")
if month == '6月':
    print("西瓜")

